---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.RoomFailures
source: html/b1d6acda-da68-b7e2-f3e0-dafe1ea9fcdf.htm
---
# BuiltInFailures.RoomFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.